SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/9KKYP41E5H/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESA!ICESMSLB\/RES.LB!1541175097910!16983929!327681</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-01-12T18:05" ArrivalDateTime="2019-01-13T07:25" FlightNumber="9699" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="AMS"/>      <Equipment AirEquipType="744"/>      <MarketingAirline Code="DL" FlightNumber="9699"/>      <OperatingAirline Code="KL"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-13T09:40" ArrivalDateTime="2019-01-13T11:55" FlightNumber="9579" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="FCO"/>      <Equipment AirEquipType="73J"/>      <MarketingAirline Code="DL" FlightNumber="9579"/>      <OperatingAirline Code="KL"/>      <OriginLocation   LocationCode="AMS"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-13T14:30" ArrivalDateTime="2019-01-14T02:20" FlightNumber="6700" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="330"/>      <MarketingAirline Code="DL" FlightNumber="6700"/>      <OperatingAirline Code="AZ"/>      <OriginLocation   LocationCode="FCO"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-24T13:10" ArrivalDateTime="2019-01-24T17:40" FlightNumber="7574" NumberInParty="1" ResBookDesigCode="X" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="DL" FlightNumber="7574"/>      <OperatingAirline Code="9W"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-24T20:05" ArrivalDateTime="2019-01-24T23:20" FlightNumber="4376" NumberInParty="1" ResBookDesigCode="X" Status="NN">      <DestinationLocation   LocationCode="JFK"/>      <Equipment AirEquipType="346"/>      <MarketingAirline Code="DL" FlightNumber="4376"/>      <OperatingAirline Code="VS"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-25T09:35" ArrivalDateTime="2019-01-25T12:54" FlightNumber="1097" NumberInParty="1" ResBookDesigCode="X" Status="NN">      <DestinationLocation   LocationCode="AUS"/>      <Equipment AirEquipType="320"/>      <MarketingAirline Code="DL" FlightNumber="1097"/>      <OperatingAirline Code="DL"/>      <OriginLocation   LocationCode="JFK"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>